<html>
<head>
<title>Caracter&iacute;sticas T&eacute;cnicas - Adsum CMMS</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

</head>

<body bgcolor="#FFFFFF" text="#000000">
<table width="781" border="1" cellspacing="1" cellpadding="15" align="center">
  <tr> 
    <td> 
      <div align="center"><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><span class="fuentes">
		<font color="#CCCCCC" face="Tahoma">Caracter&iacute;sticas 
        T&eacute;cnicas</font></span></font></div>
      <p class="fuentes"><font face="Tahoma"><span class="fuentes">
		<font size="2" class="fuentes" color="#CCCCCC">Adsum CMMS </font></span></font></p>
      <p align="center"><font face="Tahoma"><b><font size="2">Adsum CMMS </font></b></font></p>
      <p align="justify"><font size="2" color="#000080" face="Tahoma">Es una Soluci&oacute;n ideada para controlar los procesos principales 
		de gestión de mantenimiento. La producción del software se realizó bajo 
		altos estándares de calidad e ingeniería de software, lo que permite que los aplicativos 
        producidos, sean de muy alta calidad facilitando adem&aacute;s, 
        el trabajo del usuario, pues se usaron interfaces gr&aacute;ficas intuitivas 
        y soporte multi-lenguaje.</font></p>
      <p align="justify"><font face="Tahoma" size="2" color="#000080">Como 
        la producci&oacute;n se realiz&oacute; en Colombia, los aspectos como 
        capacitaci&oacute;n, asesor&iacute;a y soporte local, son garant&iacute;as 
        para las compa&ntilde;&iacute;as que adquieran nuestros productos.</font></p>
      <p><font face="Tahoma" size="2"><b>Modelo 
        Tecnol&oacute;gico<font color="#000080"> </font></b></font>
		<font color="#000080" face="Tahoma" size="2"><br>
      </font>
      <br><font color="#000080" face="Tahoma" size="2">El 
        sistema<b> Adsum CMMS</b> ha sido concebido dentro del nuevo paradigma 
        de las soluciones orientadas al WEB, que pueden ser utilizadas usando 
        la plataforma de Internet y puede ser usado de manera convergente, por 
        varios usuarios en ambientes de red local (intranet) y con usuarios fuera 
        de la red local, v&iacute;a Internet (extranet) o en ambientes Monousuario 
        Stand Alone.</font><font color="#003300" face="Tahoma" size="2"> <br>
        <br>
        </font>
      </p>
      <p align="center"><u><font color="#003300" face="Tahoma" size="2">
		<img src="../../img/ciclo Adsum.GIF" width="588" height="312"></font></u></p>
      <p align="left"><font color="#000080" face="Tahoma" size="2"><br>
        </font><b><font size="2" face="Tahoma">Componentes</font><font color="#003300" size="2" face="Tahoma"> </font> 
		</b> </p>
      <p align="justify"><font face="Tahoma" size="2" color="#000080">El 
        sistema <b>Adsum CMMS</b> soporta el almacenamiento de los datos 
        en una de las Bases de Datos l&iacute;deres del mercado, PostgreSQL www.postgresql.org. 
        Esta poderosa herramienta, posee las caracter&iacute;sticas t&eacute;cnicas 
        suficientes para soportar un ambiente exigente de negocios.</font></p>
      <p align="justify"><font face="Tahoma" size="2" color="#000080">El 
        dise&ntilde;o arquitect&oacute;nico del Sistema<b> Adsum CMMS</b>, 
        fue concebido en un modelo de niveles o capas, permitiendo independencia 
        entre la manipulaci&oacute;n de la Base de Datos, la l&oacute;gica de 
        negocios y la interfaz de usuario o presentaci&oacute;n.</font></p>
      <p align="justify"><font face="Tahoma" size="2" color="#000080">La 
        capa de manipulaci&oacute;n de los datos o nivel de persistencia, se encuentra 
        dividida en dos sub-niveles.</font></p>
      <p align="justify"><font face="Tahoma" size="2" color="#000080">1. El grupo de funciones que se integra a la Base de Datos, primer sub-nivel, 
        efect&uacute;a las operaciones CRUD, Create, Read, Update y Delete con 
        una serie de funciones especificas. Esto permite que el sistema funcione 
        con otra &quot;base de datos&quot; no implementada y r&aacute;pidamente, 
        pues solo se requiere construir las funciones CRUD especificas de ese 
        motor de Base de Datos.</font></p>
      <p align="justify"><font face="Tahoma" size="2" color="#000080">2. 
        El grupo de funciones que se integra a la funcionalidad del sistema, segundo 
        sub-nivel, efect&uacute;a la manipulaci&oacute;n l&oacute;gica de las operaciones 
        CRUD, con una serie de funciones de alto nivel de abstracci&oacute;n. 
        Este sub-nivel es independiente del Motor de Base de Datos.<br>
        </font>
        <br><font face="Tahoma" size="2" color="#000080">La 
        capa de la L&oacute;gica de Negocios, se encuentra divida en dos sub-niveles:</font></p>
      <p align="justify"><font color="#000080" face="Tahoma" size="2">1. 
        El grupo de funciones donde se encuentran las funciones que efect&uacute;an 
        todos los procesos de negocios y soporte del sistema. Este sub-nivel es 
        el que recurre a la camada de persistencia o camada de Manipulaci&oacute;n 
        de Datos.</font>
        <br><font color="#000080" face="Tahoma" size="2"><br>
        2. El grupo de funciones que se integra con las interfaces de usuario 
        y otros sistemas externos, conocido como el nivel de API&acute;s, Aplication 
        Program Interface.</font></p>
      <p align="justify"><font color="#000080" face="Tahoma" size="2">La 
        capa de presentaci&oacute;n es desarrollada en HTML, para garantizar su 
        operaci&oacute;n eficiente en los navegadores Browsers disponibles en 
        el mercado. En este nivel s&oacute;lo se maneja la presentaci&oacute;n 
        de la informaci&oacute;n, no se gestiona nada de la l&oacute;gica de negocios 
        o de datos; tambi&eacute;n incluye una herramienta basada en XML, Extended Markup 
        Lenguaje, para realizar funciones de Extracci&oacute;n, Transformaci&oacute;n 
        y Transporte de Datos hacia o desde otros sistemas.
        </font></p>
		<p align="justify"><b><font face="Tahoma" size="2">Lenguajes 
        de Desarrollo</font><font color="#003300" face="Tahoma" size="2"> </font> </b></p>
      <p align="justify"><font color="#000080" face="Tahoma" size="2"><b>Adsum 
		CMMS</b> est&aacute; desarrollado bajo plataforma WEB. Para este tipo 
        de soluciones se utiliz&oacute; el lenguaje est&aacute;ndar de programaci&oacute;n 
        en Internet HTML y para garantizar la interacci&oacute;n con los datos, 
        se utiliz&oacute; PHP 4.x.</font></p>
      <p><font color="#000080" face="Tahoma" size="2">Plataforma 
        de Hardware y Software Operativo:</font></p>
      <p><font color="#000080" face="Tahoma" size="2">&middot; 
        Windows 95, 98, 2000, NT y XP<br>
        &middot; Todas las distribuciones de Linux con ambiente gr&aacute;fico<br>
        &middot; SCO Unix, AIX, HP/UX y Solaris</font></p>
      <p><font face="Tahoma" size="2"><b>Requerimientos</b></font></p>
      <p align="left"><font face="Tahoma" size="2"><b>Servidor</b></font></p>
      <p align="justify"><font color="#000080" face="Tahoma" size="2">1. 
        <b>512</b> <b>Megas</b> en <b>RAM</b> <br>
        2.<b> 100 Megas</b> en <b>Disco Duro </b>(s&oacute;lo para la instalaci&oacute;n 
        - espacio adicional para los documentos no se incluye) <br>
        Software Servidor WEB que soporte protocolo HTTP 1.0. En la actualidad, 
        todo programa Servidor WEB cumple con &eacute;sta especificaci&oacute;n.Conexi&oacute;n 
        a la Red (si va a ser usado al interior de la empresa, debe estar conectado 
        a la red interna; si va a ser usado en la versi&oacute;n personal, no 
        requiere conectividad). <br>
        3. Sistema Operativo:<b> Windows 98, 2000 Server, NT, Linux, Solaris 
        y SCO</b> - y su configuraci&oacute;n le permite correr con seguridad 
        en cualquier plataforma <b>Unix</b> o <b>Windows</b> existente. </font></p>
      <p><font color="#000080" face="Tahoma" size="2"><br>
        </font><font face="Tahoma" size="2">
        <b>Usuarios</b></font></p>
      <p align="justify"><font color="#000080" face="Tahoma" size="2">Un 
        usuario s&oacute;lo necesita un Navegador de Internet compatible con JavaScript 
        1.2, Java VM y HTML 4.0. El explorador que actualmente cumple completamente 
        &eacute;stas caracter&iacute;sticas, es el Microsoft Internet Explorer 
        5.0, gratuito en la Red.<br>
        </font></p>
      </td>
  </tr>
  <tr> 
    <td bgcolor="#CCCCCC">&nbsp;</td>
  </tr>
</table>
</body>
</html>